# タイタニック

## 前準備
a

In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# Any results you write to the current directory are saved as output.
!pip install scikit-learn
!pip install keras
!pip install tensorflow

Requirement already satisfied: scikit-learn in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (0.22.1)
Requirement already satisfied: joblib>=0.11 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from scikit-learn) (0.14.1)
Requirement already satisfied: numpy>=1.11.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from scikit-learn) (1.18.1)
Requirement already satisfied: scipy>=0.17.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from scikit-learn) (1.4.1)
You are using pip version 19.0.3, however version 20.0.2 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.
Requirement already satisfied: keras in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (2.3.1)
Requirement already satisfied: numpy>=1.9.1 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from keras) (1.18.1)
Requirement already satisfied: six>=1.9.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from keras) (1.14.0)
Requirement already satisfied: keras-preprocessing>=1.0.5 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from keras) (1.1.0)
Requirement already satisfied: pyyaml in /Users/k2works/.local/lib/python3.7/site-packages (from keras) (3.13)
Requirement already satisfied: scipy>=0.14 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from keras) (1.4.1)
Requirement already satisfied: keras-applications>=1.0.6 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from keras) (1.0.8)
Requirement already satisfied: h5py in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from keras) (2.10.0)
You are using pip version 19.0.3, however version 20.0.2 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.
Requirement already satisfied: tensorflow in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (2.1.0)
Requirement already satisfied: keras-applications>=1.0.8 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (1.0.8)
Requirement already satisfied: gast==0.2.2 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (0.2.2)
Requirement already satisfied: keras-preprocessing>=1.1.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (1.1.0)
Requirement already satisfied: wrapt>=1.11.1 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (1.12.0)
Requirement already satisfied: astor>=0.6.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (0.8.1)
Requirement already satisfied: protobuf>=3.8.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (3.11.3)
Requirement already satisfied: wheel>=0.26; python_version >= "3" in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (0.32.3)
Requirement already satisfied: tensorflow-estimator<2.2.0,>=2.1.0rc0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (2.1.0)
Requirement already satisfied: opt-einsum>=2.3.2 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (3.1.0)
Requirement already satisfied: termcolor>=1.1.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (1.1.0)
Requirement already satisfied: grpcio>=1.8.6 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (1.27.2)
Requirement already satisfied: absl-py>=0.7.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (0.9.0)
Requirement already satisfied: scipy==1.4.1; python_version >= "3" in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (1.4.1)
Requirement already satisfied: tensorboard<2.2.0,>=2.1.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (2.1.0)
Requirement already satisfied: google-pasta>=0.1.6 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (0.1.8)
Requirement already satisfied: numpy<2.0,>=1.16.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (1.18.1)
Requirement already satisfied: six>=1.12.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorflow) (1.14.0)
Requirement already satisfied: h5py in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from keras-applications>=1.0.8->tensorflow) (2.10.0)
Requirement already satisfied: setuptools in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from protobuf>=3.8.0->tensorflow) (45.2.0)
Requirement already satisfied: google-auth-oauthlib<0.5,>=0.4.1 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorboard<2.2.0,>=2.1.0->tensorflow) (0.4.1)
Requirement already satisfied: markdown>=2.6.8 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorboard<2.2.0,>=2.1.0->tensorflow) (3.2.1)
Requirement already satisfied: werkzeug>=0.11.15 in /Users/k2works/.local/lib/python3.7/site-packages (from tensorboard<2.2.0,>=2.1.0->tensorflow) (0.14.1)
Requirement already satisfied: google-auth<2,>=1.6.3 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorboard<2.2.0,>=2.1.0->tensorflow) (1.11.2)
Requirement already satisfied: requests<3,>=2.21.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from tensorboard<2.2.0,>=2.1.0->tensorflow) (2.22.0)
Requirement already satisfied: requests-oauthlib>=0.7.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from google-auth-oauthlib<0.5,>=0.4.1->tensorboard<2.2.0,>=2.1.0->tensorflow) (1.3.0)
Requirement already satisfied: pyasn1-modules>=0.2.1 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from google-auth<2,>=1.6.3->tensorboard<2.2.0,>=2.1.0->tensorflow) (0.2.8)
Requirement already satisfied: cachetools<5.0,>=2.0.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from google-auth<2,>=1.6.3->tensorboard<2.2.0,>=2.1.0->tensorflow) (4.0.0)
Requirement already satisfied: rsa<4.1,>=3.1.4 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from google-auth<2,>=1.6.3->tensorboard<2.2.0,>=2.1.0->tensorflow) (3.4.2)
Requirement already satisfied: certifi>=2017.4.17 in /Users/k2works/.local/lib/python3.7/site-packages (from requests<3,>=2.21.0->tensorboard<2.2.0,>=2.1.0->tensorflow) (2018.8.13)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /Users/k2works/.local/lib/python3.7/site-packages (from requests<3,>=2.21.0->tensorboard<2.2.0,>=2.1.0->tensorflow) (3.0.4)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /Users/k2works/.local/lib/python3.7/site-packages (from requests<3,>=2.21.0->tensorboard<2.2.0,>=2.1.0->tensorflow) (1.23)
Requirement already satisfied: idna<2.9,>=2.5 in /Users/k2works/.local/lib/python3.7/site-packages (from requests<3,>=2.21.0->tensorboard<2.2.0,>=2.1.0->tensorflow) (2.7)
Requirement already satisfied: oauthlib>=3.0.0 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from requests-oauthlib>=0.7.0->google-auth-oauthlib<0.5,>=0.4.1->tensorboard<2.2.0,>=2.1.0->tensorflow) (3.1.0)
Requirement already satisfied: pyasn1<0.5.0,>=0.4.6 in /Users/k2works/.pyenv/versions/3.7.0/lib/python3.7/site-packages (from pyasn1-modules>=0.2.1->google-auth<2,>=1.6.3->tensorboard<2.2.0,>=2.1.0->tensorflow) (0.4.8)
You are using pip version 19.0.3, however version 20.0.2 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [2]:
import numpy as np
import pandas as pd

In [3]:
# Data Import
train = pd.read_csv('./input/titanic/train.csv')
test = pd.read_csv('./input/titanic/test.csv')
gender_submission = pd.read_csv('./input/titanic/gender_submission.csv')

In [4]:
# Check Training Data
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [5]:
# Check Test Data
test.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S

In [6]:
# Check Submission Format
gender_submission.head(10)

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1
5          897         0
6          898         1
7          899         0
8          900         1
9          901         0

In [7]:
# Check Data Shape
test_shape = test.shape
train_shape = train.shape
print(test_shape)
print(train_shape)

(418, 11)
(891, 12)

In [8]:
# Check Data Statistics
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
# Check Data Statistics
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [10]:
# Check Missing Values
def missing_table(df): 
        null_val = df.isnull().sum()
        percent = 100 * df.isnull().sum()/len(df)
        missing_table = pd.concat([null_val, percent], axis=1)
        missing_table_ren_columns = missing_table.rename(
        columns = {0 : 'missing count', 1 : '%'})
        return missing_table_ren_columns

In [11]:
missing_table(train)

             missing count          %
PassengerId              0   0.000000
Survived                 0   0.000000
Pclass                   0   0.000000
Name                     0   0.000000
Sex                      0   0.000000
Age                    177  19.865320
SibSp                    0   0.000000
Parch                    0   0.000000
Ticket                   0   0.000000
Fare                     0   0.000000
Cabin                  687  77.104377
Embarked                 2   0.224467

In [12]:
missing_table(test)

             missing count          %
PassengerId              0   0.000000
Pclass                   0   0.000000
Name                     0   0.000000
Sex                      0   0.000000
Age                     86  20.574163
SibSp                    0   0.000000
Parch                    0   0.000000
Ticket                   0   0.000000
Fare                     1   0.239234
Cabin                  327  78.229665
Embarked                 0   0.000000

In [13]:
# Fill in missing values
train["Age"] = train["Age"].fillna(train["Age"].median())
train["Embarked"] = train["Embarked"].fillna("S")

missing_table(train)

             missing count          %
PassengerId              0   0.000000
Survived                 0   0.000000
Pclass                   0   0.000000
Name                     0   0.000000
Sex                      0   0.000000
Age                      0   0.000000
SibSp                    0   0.000000
Parch                    0   0.000000
Ticket                   0   0.000000
Fare                     0   0.000000
Cabin                  687  77.104377
Embarked                 0   0.000000

In [14]:
# Convert Data to Number
train["Sex"][train["Sex"] == "male"] = 0
train["Sex"][train["Sex"] == "female"] = 1
train["Embarked"][train["Embarked"] == "S" ] = 0
train["Embarked"][train["Embarked"] == "C" ] = 1
train["Embarked"][train["Embarked"] == "Q"] = 2
 
train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,0
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,0
5,6,0,3,"Moran, Mr. James",0,28.0,0,0,330877,8.4583,NaN,2
6,7,0,1,"McCarthy, Mr. Timothy J",0,54.0,0,0,17463,51.8625,E46,0
7,8,0,3,"Palsson, Master. Gosta Leonard",0,2.0,3,1,349909,21.0750,NaN,0
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",1,27.0,0,2,347742,11.1333,NaN,0
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",1,14.0,1,0,237736,30.0708,NaN,1

In [15]:
# Convert Data to Number
test["Sex"][test["Sex"] == "male"] = 0
test["Sex"][test["Sex"] == "female"] = 1
test["Embarked"][test["Embarked"] == "S"] = 0
test["Embarked"][test["Embarked"] == "C"] = 1
test["Embarked"][test["Embarked"] == "Q"] = 2

# Fill in missing values
test["Age"] = test["Age"].fillna(test["Age"].median())
test["Fare"] = test["Fare"].fillna(test["Fare"].median())
 
test.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,2
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,0
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,2
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,0
5,897,3,"Svensson, Mr. Johan Cervin",0,14.0,0,0,7538,9.2250,NaN,0
6,898,3,"Connolly, Miss. Kate",1,30.0,0,0,330972,7.6292,NaN,2
7,899,2,"Caldwell, Mr. Albert Francis",0,26.0,1,1,248738,29.0000,NaN,0
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",1,18.0,0,0,2657,7.2292,NaN,1
9,901,3,"Davies, Mr. John Samuel",0,21.0,2,0,A/4 48871,24.1500,NaN,0

## scikit-learnの決定木を用いて実装

In [ ]:
# Decision Tree by scikit-learn
from sklearn import tree

In [16]:
target = train["Survived"].values
features_one = train[["Pclass", "Sex", "Age", "Fare"]].values
test_features = test[["Pclass", "Sex", "Age", "Fare"]].values
 
# 決定木の作成
my_tree_one = tree.DecisionTreeClassifier()
my_tree_one = my_tree_one.fit(features_one, target)
 
# 「test」の説明変数を使って「my_tree_one」のモデルで予測
my_prediction = my_tree_one.predict(test_features)

NameError: name 'tree' is not defined

In [ ]:
# 予測データのサイズを確認
my_prediction.shape

In [ ]:
#予測データの中身を確認
print(my_prediction)

In [ ]:
# PassengerIdを取得
PassengerId = np.array(test["PassengerId"]).astype(int)
 
# my_prediction(予測データ）とPassengerIdをデータフレームへ落とし込む
my_solution = pd.DataFrame(my_prediction, PassengerId, columns = ["Survived"])
 
# my_tree_one.csvとして書き出し
my_solution.to_csv("tree_submission.csv", index_label = ["PassengerId"])

## Kerasを用いて実装

In [ ]:
import keras
from keras.utils.np_utils import to_categorical
# 説明変数と目的変数に分割
keras_y_train = train["Survived"].values

COLUMNS = ["Pclass", "Sex", "Age", "Fare"]
keras_x_train = train[COLUMNS].values
 
keras_x_test = test[COLUMNS].values

In [ ]:
import numpy as np
from keras.models import Sequential
from keras.layers import Dense, Dropout
 
# モデル作成
model = Sequential()
model.add(Dense(32, input_shape=(len(COLUMNS),), activation='relu'))
model.add(Dropout(0.25))
model.add(Dense(16, activation='relu'))
model.add(Dropout(0.25))
model.add(Dense(1, activation='sigmoid'))
 
model.compile(loss='binary_crossentropy',
              optimizer='rmsprop',
              metrics=['accuracy'])
 
model.fit(
    keras_x_train, 
    keras_y_train, 
    epochs=30, 
    batch_size=1, 
    verbose=1)

In [ ]:
predictions = model.predict(keras_x_test)
 
# テスト値を再読み込みして，クラス分類したカラムを追加
df_out = pd.read_csv("./input/titanic/test.csv")
df_out["Survived"] = np.round(predictions).astype(np.int)
 
# outputディレクトリに出力する
df_out[["PassengerId","Survived"]].to_csv("keras_submission.csv",index=False)